McKinsey wants to understand the relation between GDP per capita and life expectancy and 
various trends for their clients.
The company has acquired data from multiple surveys in different countries in the past
This contains info of several years about:
country
population size
life expectancy
GDP per Capita
We have to analyse the data and draw inferences meaningful to the company

In [4]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv(r""C:\Users\PC\Downloads\mckinsey.csv")

In [6]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [7]:
df.head(10)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106
5  Afghanistan  1977    14880372      Asia    38.438  786.113360
6  Afghanistan  1982    12881816      Asia    39.854  978.011439
7  Afghanistan  1987    13867957      Asia    40.822  852.395945
8  Afghanistan  1992    16317921      Asia    41.674  649.341395
9  Afghanistan  1997    22227415      Asia    41.763  635.341351

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [11]:
df.shape

(1704, 6)

In [12]:
df.shape[0]

1704

In [13]:
df.shape[1]

6

In [14]:
df.size

10224

In [15]:
(1704 * 6)

10224

In [16]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [17]:
df.describe(include= "object")

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

In [18]:
df1 = pd.DataFrame([
    ["India",1952,165551,"Asia",21,100],
    ["India",1953,5626222,"Asia",22,222]
])

In [19]:
df1.head()

       0     1        2     3   4    5
0  India  1952   165551  Asia  21  100
1  India  1953  5626222  Asia  22  222

In [20]:
df2 = pd.DataFrame([
    ["India",1952,165551,"Asia",21,100],
    ["India",1953,5626222,"Asia",22,222]
],columns = ['country','year','population','continent','life_exp','gdp_cap'])

In [21]:
df2

  country  year  population continent  life_exp  gdp_cap
0   India  1952      165551      Asia        21      100
1   India  1953     5626222      Asia        22      222

In [22]:
df3 = pd.DataFrame({
    "country":["India","India"],
    "year":[2633,2263],
    "population":[11111111,66666666],
    "continent":["Asia","Asia"],
    "life_exp":[200,300],
    "gdp_cap":[80,70]
})

In [23]:
df3

  country  year  population continent  life_exp  gdp_cap
0   India  2633    11111111      Asia       200       80
1   India  2263    66666666      Asia       300       70

In [24]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [25]:
df["life_exp"].head()

0    28.801
1    30.332
2    31.997
3    34.020
4    36.088
Name: life_exp, dtype: float64

In [26]:
df.year.head()

0    1952
1    1957
2    1962
3    1967
4    1972
Name: year, dtype: int64

In [27]:
df.life_exp.head(10)

0    28.801
1    30.332
2    31.997
3    34.020
4    36.088
5    38.438
6    39.854
7    40.822
8    41.674
9    41.763
Name: life_exp, dtype: float64

In [28]:
df[["gdp_cap","continent"]].head(10)

      gdp_cap continent
0  779.445314      Asia
1  820.853030      Asia
2  853.100710      Asia
3  836.197138      Asia
4  739.981106      Asia
5  786.113360      Asia
6  978.011439      Asia
7  852.395945      Asia
8  649.341395      Asia
9  635.341351      Asia

In [29]:
df["country"].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [30]:
df["country"].nunique()

142

In [31]:
df["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [32]:
df["continent"].value_counts()

continent
Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [33]:
df["year"].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [34]:
df["year"].value_counts()

year
1952    142
1957    142
1962    142
1967    142
1972    142
1977    142
1982    142
1987    142
1992    142
1997    142
2002    142
2007    142
Name: count, dtype: int64

In [35]:
df["country"].value_counts()

country
Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: count, Length: 142, dtype: int64

In [36]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [37]:
df.rename({"country":"Country"},axis=1,inplace= True)

In [38]:
df.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [39]:
df.tail()

       Country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [40]:
df.drop(["year"],axis=1)

          Country  population continent  life_exp     gdp_cap
0     Afghanistan     8425333      Asia    28.801  779.445314
1     Afghanistan     9240934      Asia    30.332  820.853030
2     Afghanistan    10267083      Asia    31.997  853.100710
3     Afghanistan    11537966      Asia    34.020  836.197138
4     Afghanistan    13079460      Asia    36.088  739.981106
...           ...         ...       ...       ...         ...
1699     Zimbabwe     9216418    Africa    62.351  706.157306
1700     Zimbabwe    10704340    Africa    60.377  693.420786
1701     Zimbabwe    11404948    Africa    46.809  792.449960
1702     Zimbabwe    11926563    Africa    39.989  672.038623
1703     Zimbabwe    12311143    Africa    43.487  469.709298

[1704 rows x 5 columns]

In [41]:
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [42]:
# arr ** 2

In [43]:
df["add_5_year"]=df["year"]+5

In [44]:
df

,Country,year,population,continent,life_exp,gdp_cap,add_5_year
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1957
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1962
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1967
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1972
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1977
...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1992
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1997
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2002
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2007
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2012

In [45]:
df["diff"]=df["year"]-df["add_5_year"]

In [46]:
df

,Country,year,population,continent,life_exp,gdp_cap,add_5_year,diff
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1957,-5
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1962,-5
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1967,-5
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1972,-5
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1977,-5
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1992,-5
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1997,-5
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2002,-5
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2007,-5
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2012,-5

In [47]:
df.columns

Index(['Country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap',
       'add_5_year', 'diff'],
      dtype='object')

In [48]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [49]:
df.index.values

array([   0,    1,    2, ..., 1701, 1702, 1703], dtype=int64)

In [50]:
custom_index = [i for i in range(1,1705)]

In [51]:
df.index = custom_index

In [52]:
df.index.values

array([   1,    2,    3, ..., 1702, 1703, 1704], dtype=int64)

In [53]:
df

,Country,year,population,continent,life_exp,gdp_cap,add_5_year,diff
1,Afghanistan,1952,8425333,Asia,28.801,779.445314,1957,-5
2,Afghanistan,1957,9240934,Asia,30.332,820.853030,1962,-5
3,Afghanistan,1962,10267083,Asia,31.997,853.100710,1967,-5
4,Afghanistan,1967,11537966,Asia,34.020,836.197138,1972,-5
5,Afghanistan,1972,13079460,Asia,36.088,739.981106,1977,-5
...,...,...,...,...,...,...,...,...
1700,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1992,-5
1701,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1997,-5
1702,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2002,-5
1703,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2007,-5
1704,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2012,-5

In [54]:
df.reset_index(drop=True, inplace = True)

In [55]:
df

,Country,year,population,continent,life_exp,gdp_cap,add_5_year,diff
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1957,-5
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1962,-5
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1967,-5
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1972,-5
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1977,-5
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1992,-5
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1997,-5
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2002,-5
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2007,-5
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2012,-5

In [56]:
# explicit and implicit index

In [57]:
a = pd.Series(["a","b","c","d","e","f","g","h"])

In [59]:
a #implicit index

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [60]:
b = pd.Series(["a","b","c","d","e","f","g","h"],index=[1,2,3,4,5,6,7,8])

In [61]:
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
dtype: object

In [62]:
a

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [63]:
a[3]

'd'

In [64]:
a[3:7]

3    d
4    e
5    f
6    g
dtype: object

In [65]:
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
dtype: object

In [66]:
b[4]

'd'

In [67]:
b[4:8]

5    e
6    f
7    g
8    h
dtype: object

In [68]:
b.loc[4:8]

4    d
5    e
6    f
7    g
8    h
dtype: object

In [69]:
b.iloc[4:8]

5    e
6    f
7    g
8    h
dtype: object

In [70]:
df

,Country,year,population,continent,life_exp,gdp_cap,add_5_year,diff
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1957,-5
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1962,-5
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1967,-5
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1972,-5
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1977,-5
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1992,-5
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1997,-5
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2002,-5
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2007,-5
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2012,-5

In [73]:
df.loc[4:6]

,Country,year,population,continent,life_exp,gdp_cap,add_5_year,diff
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1977,-5
5,Afghanistan,1977,14880372,Asia,38.438,786.113360,1982,-5
6,Afghanistan,1982,12881816,Asia,39.854,978.011439,1987,-5

In [76]:
df.loc[4:6,"Country":"population"]

       Country  year  population
4  Afghanistan  1972    13079460
5  Afghanistan  1977    14880372
6  Afghanistan  1982    12881816

In [78]:
df.iloc[4:7,0:3]

       Country  year  population
4  Afghanistan  1972    13079460
5  Afghanistan  1977    14880372
6  Afghanistan  1982    12881816

In [79]:
df.loc[[2,4],["Country","continent"]]

       Country continent
2  Afghanistan      Asia
4  Afghanistan      Asia

In [80]:
df.tail()

,Country,year,population,continent,life_exp,gdp_cap,add_5_year,diff
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1992,-5
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1997,-5
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2002,-5
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2007,-5
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2012,-5

In [81]:
df.drop(["add_5_year","diff"],axis=1,inplace=True)

In [83]:
df.tail()

       Country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [84]:
new_row = {"Country":"India",	"year":2000,	"population":10000000,	"continent":"Asia",	"life_exp":50,	"gdp_cap":900}

In [87]:
# df.append(new_row,ignore_index=True)

In [89]:
df.loc[len(df.index)]=["India",2000,10000000,"Asia",50,900]

In [90]:
df.tail()

       Country  year  population continent  life_exp     gdp_cap
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704     India  2000    10000000      Asia    50.000  900.000000

In [92]:
df.loc[len(df.index)] = ['Sri Lanka',2022 ,130000000,"Asia",80.00,500.00] 
df.loc[len(df.index)] = ['Sri Lanka',2022 ,130000000,"Asia",80.00,500.00] 
df.loc[len(df.index)] = ['India',2000 ,13500000,"Asia",80.00,900.23]

In [93]:
df.tail()

        Country  year  population continent  life_exp     gdp_cap
1703   Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704      India  2000    10000000      Asia    50.000  900.000000
1705  Sri Lanka  2022   130000000      Asia    80.000  500.000000
1706  Sri Lanka  2022   130000000      Asia    80.000  500.000000
1707      India  2000    13500000      Asia    80.000  900.230000

In [100]:
df.duplicated().tail()

1703    False
1704    False
1705    False
1706     True
1707    False
dtype: bool

In [101]:
df.drop_duplicates(keep="first",inplace=True)

In [105]:
df.reset_index(inplace=True)

In [109]:
df.drop("index",inplace=True,axis=1)

In [110]:
df.tail()

        Country  year  population continent  life_exp     gdp_cap
1702   Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703   Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704      India  2000    10000000      Asia    50.000  900.000000
1705  Sri Lanka  2022   130000000      Asia    80.000  500.000000
1706      India  2000    13500000      Asia    80.000  900.230000

In [111]:
df.sort_values("life_exp",ascending=False)

               Country  year  population continent  life_exp       gdp_cap
803              Japan  2007   127467972      Asia    82.603  31656.068060
671   Hong Kong, China  2007     6980412      Asia    82.208  39724.978670
802              Japan  2002   127065841      Asia    82.000  28604.591900
695            Iceland  2007      301931    Europe    81.757  36180.789190
1487       Switzerland  2007     7554661    Europe    81.701  37506.419070
...                ...   ...         ...       ...       ...           ...
1344      Sierra Leone  1952     2143249    Africa    30.331    879.787736
36              Angola  1952     4232095    Africa    30.015   3520.610273
552             Gambia  1952      284320    Africa    30.000    485.230659
0          Afghanistan  1952     8425333      Asia    28.801    779.445314
1292            Rwanda  1992     7290203    Africa    23.599    737.068595

[1707 rows x 6 columns]

In [114]:
df.sort_values(["year","life_exp"],ascending = [False,True])

           Country  year  population continent  life_exp       gdp_cap
1705     Sri Lanka  2022   130000000      Asia    80.000    500.000000
1463     Swaziland  2007     1133066    Africa    39.613   4513.480643
1043    Mozambique  2007    19951656    Africa    42.082    823.685621
1691        Zambia  2007    11746035    Africa    42.384   1271.211593
1355  Sierra Leone  2007     6144562    Africa    42.568    862.540756
...            ...   ...         ...       ...       ...           ...
408        Denmark  1952     4334000    Europe    70.780   9692.385245
1464        Sweden  1952     7124673    Europe    71.860   8527.844662
1080   Netherlands  1952    10381988    Europe    72.130   8941.571858
684        Iceland  1952      147962    Europe    72.490   7267.688428
1140        Norway  1952     3327728    Europe    72.670  10095.421720

[1707 rows x 6 columns]

In [115]:
users = pd.DataFrame({"userid":[1,2,3],
                     "name":["Kirti","Rohan","Adeeb"]})
users

   userid   name
0       1  Kirti
1       2  Rohan
2       3  Adeeb

In [116]:
msgs = pd.DataFrame({
    "user_id":[1,1,2,4],
    "msg":["hmmm","acha","get","lost"]
})

msgs

   user_id   msg
0        1  hmmm
1        1  acha
2        2   get
3        4  lost

In [117]:
pd.concat([users,msgs],axis=0)

   userid   name  user_id   msg
0     1.0  Kirti      NaN   NaN
1     2.0  Rohan      NaN   NaN
2     3.0  Adeeb      NaN   NaN
0     NaN    NaN      1.0  hmmm
1     NaN    NaN      1.0  acha
2     NaN    NaN      2.0   get
3     NaN    NaN      4.0  lost

In [118]:
pd.concat([users,msgs],axis=1)

   userid   name  user_id   msg
0     1.0  Kirti        1  hmmm
1     2.0  Rohan        1  acha
2     3.0  Adeeb        2   get
3     NaN    NaN        4  lost

In [119]:
msgs.merge(users,left_on="user_id",right_on="userid",how="inner")

   user_id   msg  userid   name
0        1  hmmm       1  Kirti
1        1  acha       1  Kirti
2        2   get       2  Rohan

In [120]:
msgs.merge(users,left_on="user_id",right_on="userid",how="left")

   user_id   msg  userid   name
0        1  hmmm     1.0  Kirti
1        1  acha     1.0  Kirti
2        2   get     2.0  Rohan
3        4  lost     NaN    NaN

In [121]:
msgs.merge(users,left_on="user_id",right_on="userid",how="right")

   user_id   msg  userid   name
0      1.0  hmmm       1  Kirti
1      1.0  acha       1  Kirti
2      2.0   get       2  Rohan
3      NaN   NaN       3  Adeeb

In [122]:
msgs.merge(users,left_on="user_id",right_on="userid",how="outer")

   user_id   msg  userid   name
0      1.0  hmmm     1.0  Kirti
1      1.0  acha     1.0  Kirti
2      2.0   get     2.0  Rohan
3      NaN   NaN     3.0  Adeeb
4      4.0  lost     NaN    NaN